gatamt/P4_Sight/GATA_P4_ESP_VIDEO/components/esp-video-components/esp_video/examples/simple_video_server/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.4.2 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32p4"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_EXAMPLE_CAMERA_VIDEO_BUFFER_NUMBER=5
CONFIG_EXAMPLE_JPEG_COMPRESSION_QUALITY=50
CONFIG_EXAMPLE_ENCODED_QUEUE_DEPTH=8
CONFIG_EXAMPLE_M2M_CAP_COUNT=4
CONFIG_EXAMPLE_CONNECT_WIFI=y
CONFIG_EXAMPLE_WIFI_SSID="Apto201"
CONFIG_EXAMPLE_WIFI_PASSWORD="ursinhafofa4559"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=8192
CONFIG_ESP_DEBUG_STUBS_ENABLE=y
CONFIG_LWIP_MAX_SOCKETS=22
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65535
CONFIG_LWIP_TCP_WND_DEFAULT=65535
CONFIG_LWIP_TCP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCP_OOSEQ_MAX_PBUFS=4
CONFIG_VFS_MAX_COUNT=10
CONFIG_CAMERA_IMX708=y
CONFIG_CAMERA_IMX708_MIPI_RAW10_800X640_15FPS=y
CONFIG_ESP_VIDEO_ENABLE_SPI_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_HW_JPEG_VIDEO_DEVICE=y
CONFIG_WIFI_RMT_STATIC_RX_BUFFER_NUM=10
CONFIG_WIFI_RMT_RX_BA_WIN=6
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
